Autodesk.Revit.DB.EdgeEndPoint.Equals(Autodesk.Revit.DB.EdgeEndPoint)
Determines whether this EdgeEndPoint is equal to another.
other:
The EdgeEndPoint with which to compare this EdgeEndPoint.
Returns:
True if the given EdgeEndPoint is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.#ctor(Autodesk.Revit.DB.EdgeEndPoint)
Creates a copy of the given EdgeEndPoint instance.
otherObject:
The given EdgeEndPoint instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.EdgeEndPoint.#ctor(Autodesk.Revit.DB.Edge,System.Int32)
Constructs an instance of EdgeEndPoint.
edge:
The Edge.
index:
Use 0 for the start point, 1 for the end point of an Edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for index is not 0 or 1.
Since:
2021